[
    {
        "id": "P0",
        "name": "Sage",
        "type": "Medicinal",
        "category": "Perennial",
        "image": "sage.jpg",
        "description": "Sage’s genus name, Salvia, means “to heal” reflecting its early use as a medicinal (not culinary) herb, it prevents mouth and throat inflammations.",
        "light_requirements": "Full sun",
        "planting_Space": "18 to 24 inches apart",
        "soil_requirements": "Plants grow best in well-drained soil. For clay soil, add sand and organic matter to provide better drainage, or grow plants in raised beds or containers. Soil pH should be 6.5 to 7.0.",
        "water_requirements": "Keep soil moist after planting until plants are well-rooted. Once established, plants in beds survive on rainfall. In containers, irrigate whenever soil is dry. Consider a pebble mulch to promote warmth and dryness beneath leaves, especially in humid areas.",
        "common_issues": "In coldest zones, sage can take a while to leaf out; be patient before pulling plants. Prune plants back in early spring, cutting out oldest growth to promote new growth. Sage tends to get woody and stop producing lots of branches after 3 to 5 years. At this point, consider replacing your plant. Mildew can be a problem, especially in humid areas. Thin plants regularly to promote air circulation.",
        "harvesting": "Pick leaves at any point in the growing season. In zones in which sage is perennial, harvest plants lightly the first year. With established plants, stop harvesting 2 months prior to frost to give new leaves time to mature. To harvest, cut an entire stem if desired, or just pinch a leaf at a time.",
        "storage_wrap": "Fresh sage leaves in a barely damp paper towel and tuck into a loosely closed plastic bag. Store in the refrigerator. Use within 4 to 5 days. For longer storage, dry leaves.",
        "others": "Sage is perennial in zones 5 to 8. Established plants can survive a few hard frosts (under 28º F). Use a frost blanket to protect newly planted seedlings from late spring frosts or prolong the growing season in fall."        
    },
    {
        "id": "P1",
        "name": "German Chamomile",
        "type": "Medicinal",
        "category": "Annual",
        "image": "chamomile.jpg",
        "description": "Use chamomile flower heads for infusions and salves. It is also used used for making tea. It prevents indigestion, anxiety, skin inflammations.",
        "light_requirements": "Full sun or partial shade",
        "planting_Space": "Single Plants: 11 inches (30cm) each way (minimum) & Rows: 9 inch (25cm) with 1' 3 (40cm) row gap (minimum)",
        "soil_requirements": "Fertile, well drained soil.",
        "water_requirements": "Care of chamomile indoors is easy. The pot should be kept near a south-facing window. The soil should be kept moist but not overly wet; watering once per week should be enough. After 60 to 90 days, the plant should be ready to harvest for tea.",
        "common_issues": "Rabbits enjoy nibbling chamomile foliage. Aphids, slug and snails affects chamomile",
        "harvesting": "Cut branches when they are holding numerous open flowers, and hang in small bunches to dry. Chamomile tea is made from the blossoms only. When the stems are dry, pop off the blossoms and store them in an airtight container.",
        "storage_wrap": "Sift through your flower heads ensuring you rid of any bugs and place in a pan, uncovered, in a cool location to dry. Once the flowers are dry, save in a sealed container, such as a mason jar, free of moisture and store in a cool location.",
        "others": "Young seedlings easily tolerate spring frosts, and may survive winters in mild climates. The easiest chamomile to grow is a cool-season annual. Feathery chamomile foliage contrasts well with the textures of other herbs and flowers."        
    },
    {
        "id": "P2",
        "name": "Basil",
        "type": "Medicinal",
        "category": "Annual",
        "image": "basil.jpg",
        "description": "Basil, (Ocimum basilicum), also called sweet basil, annual herb of the mint family (Lamiaceae), grown for its aromatic leaves. Basil is likely native to India and is widely grown as a kitchen herb. The leaves are used fresh or dried to flavour meats, fish, salads, and sauces; basil tea is a stimulant. It is basically used in Asian and Italian dishes. It prevents lack of appetite, cuts and scrapes",
        "light_requirements": "Full sun is ideal, but plants can grow in part shade.",
        "planting_Space": "18 inches",
        "soil_requirements": "Plants grow best in rich, moist but well-drained soil with a pH of 6.0 to 7.0. Work organic matter into soil before planting to add fertility and improve moisture retention. In containers, use premium quality potting soil.",
        "water_requirements": "Keep soil consistently moist through the growing season. Add a mulch layer to slow water evaporation from soil. In containers, water whenever the top inch of soil is dry.",
        "common_issues": "Pinch flower buds to keep plants from bolting. Once flowers form, leaf flavor changes. Pests to watch out for: aphids, slugs, Japanese beetles, and earwigs. Fungal diseases sometimes occur in humid climates, and root rot is common in poorly drained soil.",
        "harvesting": "Pick leaves at any point in the growing season. Choose individual leaves, or snip leafy stems to the length you desire.",
        "storage_wrap": "Cut basil stems and place in water like a fresh bouquet. They’ll last for weeks, provided you remove any leaves below the water line and change water regularly. Never place basil in the refrigerator; the cold air damages leaves. Preserve basil by freezing or in herbal vinegars.",
        "others": "Basil is very frost-tender and damaged by temperatures below 40º F. Use a frost blanket to protect newly planted seedlings from late spring frosts or prolong the fall growing season."        
    },
    {
        "id": "P3",
        "name": "Feverfew",
        "type": "Medicinal",
        "category": "Perennial",
        "image": "feverfew.jpg",
        "description": "Use leaves and flowers for teas; chew leaves to ease headaches (including migraines), it is also used for arthritis, skin conditions.",
        "light_requirements": "Full sun to partial afternoon shade.",
        "planting_Space": "Single Plants: 11 inches (30cm) each way (minimum) & for Rows: 11 inches (30cm) row gap (minimum)",
        "soil_requirements": "Any sunny site with good drainage. Mix a light application of a balanced organic fertilizer into the soil prior to planting. When plants emerge after their first winter, mulch with rich compost or topdress with a balanced organic fertilizer.",
        "water_requirements": "Spray water to keep the seeds moist as poured water may dislodge the seeds. When placed in a sunny window or under a grow light, you should see signs of the feverfew seeds germinating in about two weeks. When the plants are about 3 inches tall, plant them, pot and all, into a sunny garden spot and water regularly until the roots take hold. As with the indoor seeds, water by misting so you don’t wash the seeds away.",        
        "common_issues": "Feverfew can reseed too well in hospitable spaces, so keep an eye on it for invasive tendencies.",
        "harvesting": "To harvest for medicinal use, gather when the plants are in full flower but still holding an abundance of greenery. Medicinal preparations are made from a mixture of dried flowers and leaves.",
        "storage_wrap": "The leaf material should be stored in a cool, dark area as it has been found that dried feverfew leaf loses at least 20% of its parthenolide content in the first year and more than 50% after two years of storage unprotected from heat and light.",
        "others": "Six-month-old, well rooted plants tolerate winter temperatures to -20F (-29C). Most individual plants die in their second or third summer, after blooming heavily."        
    },
    {
        "id": "P4",
        "name": "Tulip",
        "type": "Bulbose",
        "category": "Perennial",
        "image": "tulip2.jpg",
        "description": "Tulip bulbs are planted in the autumn before the ground freezes. Although tulips are a perennial from a botanical perspective, many centuries of hybridizing means that the bulb’s ability to come back year after year has weakened. Therefore, many gardeners treat them as annuals, planting new bulbs every autumn.",
        "light_requirements": "6 to 8 hours of direct sun each day. Tulips won’t grow well in shade and will rot in wet soil.",        
        "planting_Space": "Large enough planting site.",
        "soil_requirements": "Tulips prefer a sandy loam soil and excellent drainage, and detest being sunk in soggy beds.",
        "water_requirements": "If it is, add water to keep the soil moist, but not muddy, because tulip bulbs rot if they sit in too wet an environment. Once the tulip emerges, water whenever the top 1/2 inch of soil is dry.",
        "common_issues": "Most problems with tulips are fungal in nature. One common tulip fungal disease is the Botrytis blight, also known as tulip fire or mycelial neck rot. This problem affects every part of the tulip. It appears as discolored, singed-looking spots on the leaves and petals.",
        "harvesting": "Grasp the stem of the flower. Cut the main stem, but let the leaves remain in the ground. Do not try to remove the bulb or the leaves if you want flowers next year.",
        "storage_wrap": "Tulip bulbs need cold storage each year in mild winter climates. This allows the bulbs to rest and develop flower buds. Storing the tulip bulb in a refrigerator around 40 degrees Fahrenheit gives the bulbs a cold dormant period.",
        "others": "Hardy spring bulbs such as tulips and daffodils survive frozen ground where air temperatures dip to minus 40 degrees Fahrenheit. Some other bulb plants even bloom through snow, leading the way in spring. Provided they are not in bloom, tulips and daffodils are tough enough to survive a few nights of light frost."        
    },
    {
        "id": "P5",
        "name": "Lemon Balm",
        "type": "Medicinal",
        "category": "Perennial",
        "image": "lemon-balm.jpg",
        "description": "Medicinal uses of lemon balm: Anxiety, insomnia, wounds, herpes, insect bites, flatulence, upset stomach.",
        "light_requirements": "Full sun to part shade. Protect plants from hot afternoon sun in southerly zones.",
        "planting_Space": "20 to 24 inches apart",
        "soil_requirements": "Nutrient-rich, well-drained soil is ideal",
        "water_requirements": "Lemon balm thrives in moist soil that’s not soggy. Improve drainage in wet areas by adding organic matter to soil.",
        "common_issues": "Lemon balm can spread rapidly in the garden. Help prevent self-sowing by clipping stems back to a few inches several times during the growing season, so the plants don’t set seeds. Clip as soon as flowers appear. Lemon balm is generally pest-free.",
        "harvesting": "Pick lemon balm leaves at any point in the growing season. Leaves tend to become smaller after plants flower. Clip leafy stems to be as long as you want. Plants branch freely from just below where you snip stems, so place cuts accordingly.",
        "storage_wrap": "Fresh lemon balm stems keep in water at room temperature five to seven days. For longer storage, dry or freeze leaves. Individually quick freeze leaves on a parchment-lined tray and store in freezer bags or freeze in ice cubes.",
        "others": "Lemon balm is perennial in zones 4 to 9. Plants are not frost-tolerant. If you need plants to survive a light frost, cover them with a frost blanket."        
    },
    {
        "id": "P6",
        "name": "Parsley",
        "type": "Medicinal",
        "category": "Biennial",
        "image": "parsley.jpg",
        "description": "Medicinal uses for parsley: Flatulence, bad breath",
        "light_requirements": "full sun or partial shade",
        "planting_Space": "18 to 24 inches apart",
        "soil_requirements": "Rich, moist soil with a pH between 5.5 and 6.7. Add a slow-release fertilizer to the soil before or at planting. Keep the soil moist. Keep roots cool and moist by mulching around the plant, but don’t cover the crown of the plant or the plant will risk getting rot.",
        "water_requirements": "Average water needs. Water on a regular schedule, but do not overwater. Allow soil to go dry between waterings, then soak thoroughly.",
        "common_issues": "Parsley (along with dill and fennel) is a favorite food of the brightly striped parsleyworm caterpillar, which becomes the treasured black swallowtail butterfly. Some gardeners plant enough parsley for themselves and the beautiful butterflies-to-be, which are likely to appear in late summer and fall.",
        "harvesting": "Gather parsley stems and leaves as needed. Harvest parsley by cutting the leafy stems from the base of the plant—this will also serve to make the plant grow back bushier.",
        "storage_wrap": "Freeze parsley for winter use; although it is easily dried, it does not keep its flavour well.",
        "others": "Parsley is an annual in the North, growing from spring until freezing weather. In milder climates, it is frost-proof and lives through winter."        
    },
    {
        "id": "P7",
        "name": "Thyme",
        "type": "Medicinal",
        "category": "Perennial",
        "image": "thyme1.jpg",
        "description": "The active principle in thyme, thymol, is a strong antiseptic. Medicinal uses of thyme: Coughs, congestion, indigestion, gas.",
        "light_requirements": "Thyme does best in full sun. Start from young plants set out in spring after the last frost.",
        "planting_Space": "Single Plants: 11inch (30cm) each way (minimum) & Rows: 11inch (30cm) with 1' 3 inch (40cm) row gap (minimum)",
        "soil_requirements": "Plant in well-drained soil with a pH of about 7.0; it prefers slightly alkaline conditions. Add lime to the pot or ground to raise the pH if needed. Also add a slow-release fertilizer to the soil at or before planting and again each spring.",
        "water_requirements": "Most varieties of thyme are drought-resistant, so only give a thorough watering, when the soil is completely dry.",
        "common_issues": "Plants are often short-lived, so root a few stem cuttings each spring to always have vigorous young plants.",
        "harvesting": "Gather sprigs as needed in the kitchen. Gather stems for drying in summer, before the plants bloom.",
        "storage_wrap": "Store fresh thyme in a plastic bag in the vegetable crisper drawer of your refrigerator or stand sprigs in a glass of water on the refrigerator shelf.",
        "others": "Very winter hardy. Becomes dormant from fall to spring."        
    },
    {
        "id": "P8",
        "name": "Aloe vera",
        "type": "Medicinal",
        "category": "Perennial",
        "image": "aloe-vera2.jpg",
        "description": "Extremely easy to grow, aloe vera is India’s most favorite and a succulent plant that is low-on-maintenance and easy-to-grow! The plant is a trusted remedy for Indians to treat skin inflammation, breakouts, and burns. Its juice is well-known to boost a weak immune system. It is believed to be full of oxidants, which help the body to fight free radicals and stay fit as well as young!",
        "light_requirements": "A balance of sunshine is essential",
        "planting_Space": "Look for a medium or large planter with good drainage capabilities.",
        "soil_requirements": "Aloe vera grows best in dry soil. Cactus potting soil mix is ideal.",
        "water_requirements": "Don’t overwater: The soil should feel damp, not soaked",
        "common_issues": "Like any plant, aloe vera can suffer from bugs, disease, and fungus on its stem or roots. Mealybugs and scale, which are small, flat tan or brown bugs that suck the sap from aloe, are the most common insect problems. You should also be mindful of leaf rot, as this is a common ailment for aloe.",
        "harvesting": "Once your plant has matured, remove the outside-most leaves.",
        "storage_wrap": "Wrap the leaf in plastic wrap, taking care to cover the cut end where it used to be connected to the rest of the plant. Once you’re ready to use the leaf, simply unwrap it from the plastic wrap and begin the process to extract the gel",
        "others": "Soil, water, and sunlight are the necessities. Rotate the plant for even sunlight exposure, and repot when needed. Keep the soil damp to dry to avoid fungus. Bugs can be handled with a natural, organic pesticide."        
    },
    {
        "id": "P9",
        "name": "Lemongrass",
        "type": "Medicinal",
        "category": "Perennial",
        "image": "lemon-grass.jpg",
        "description": "Lemongrass’ therapeutic effect is widely known. Drink lemongrass tea to relieve a sore throat and menstrual pain. If you have trouble sleeping, drinking lemongrass tea before sleeping can help you get rid of insomnia and stress. Lemongrass is also helpful in pain management and has anti-pyretic properties.",
        "light_requirements": "Full sun",
        "planting_Space": "Single Plants: 2' 3 inches (70cm) each way (minimum) & Rows: 1' 11 inches (60cm) with 2' 11 inches (90cm) row gap (minimum)",
        "soil_requirements": "Rich well drained soil. If you’re growing it in a pot, top-dress it with compost or worm castings every couple of weeks, to make sure it’s getting plenty of nutrients.",
        "water_requirements": "Plenty of water",
        "common_issues": "Plants may rot in poorly drained clay soil. When lemongrass is grown in containers, shift the plants to larger pots as needed. When the roots become crowded, they can cause clay pots to crack.",
        "harvesting": "Leave the plant to develop some thick stems before starting to harvest. The most tender leaves are found close to the stems.",
        "storage_wrap": "Cut lemongrass in the refrigerator, tightly wrapped, for up to 2 weeks.",
        "others": "Lemongrass is a tropical plant that freezes to death where winter temperatures drop below 15F (-9C). In all climates, potted plants are easy to keep through winter indoors."        
    },
    {
        "id": "P10",
        "name": "Cactus",
        "type": "Ornamental",
        "category": "Perennial",
        "image": "cacti.jpg",
        "description": "A cactus is a plant that grows where the soil is dry and rocky—most usually in the desert. A cactus doesn't have leaves like other plants do. A cactus has spines or thorns. The plural word for cactus is cacti.",
        "light_requirements": "Bright/High light",
        "planting_Space": "A cactus should have a minimum of 1/4 inch of space between its main body and the pot's rim.",
        "soil_requirements": "Cacti require a porous, sandy or pebbly potting soil that provides plenty of aeration and excellent drainage. A good cactus potting mixture will also consist of some organic material that makes moisture available to the plant roots when watered but then dries out quickly.",
        "water_requirements": "Water lightly",
        "common_issues": "As with any plant, cacti can become diseased or damaged. A common problem is soft spots in the flesh of the plant. Over-watering can encourage problems with rot, and (unfortunately) there’s not a whole lot you can do about it other than starting over.",
        "harvesting": "Not Available",
        "storage_wrap": "Not Available",
        "others": "Some brings good luck, some improves health, while some are not so good. According to Feng Shui keeping cactus in our houses are actually lucky. The only safe position for a cactus plant in your home is the fame and reputation quadrant."        
    },
    {
        "id": "P11",
        "name": "Sago",
        "type": "Palm Plant",
        "category": "Perennial",
        "image": "sago.jpg",
        "description": "The sago palm (Cycas revoluta) is a popular houseplant known for its feathery foliage and ease of care.",        
        "light_requirements": "Bright light, although they will tolerate low-light conditions.",
        "planting_Space": "A cactus should have a minimum of 1/4 inch of space between its main body and the pot's rim.",
        "soil_requirements": "Sago palms prefer to be situated in well-drained soil.",        
        "water_requirements": "Water lightly, they do not respond well to overwatering. It’s best to allow the plant to dry out some between waterings.",
        "common_issues": "While sago palms, are problem-free plants, you may on occasion encounter problems with sago palms. One of the most common complaints is sago palm yellowing. However, as is the case with most cycads, this is a normal reaction as the plant conserves nutrients — with older leaves turning yellow and then brown.",        
        "harvesting": "Put on gardening gloves to harvest sago babies in late winter or very early spring, before new growth emerges and the mother plant is still dormant. Take the pups when they're at least 2 inches wide at their broadest points; by then, the offsets may have formed a few roots.",
        "storage_wrap": "Not Available",
        "others": "Not Available."        
    },
    {
        "id": "P12",
        "name": "Parlor Palm",
        "type": "Palm Plant",
        "category": "Perennial",
        "image": "Parlor-palm.png",
        "description": "The parlor palm is the quintessential houseplant – the proof is right in the name. Growing a parlor palm tree indoors is ideal because it grows very slowly and thrives in low light and cramped space. It’s also an excellent air purifier.",        
        "light_requirements": "Parlor palm houseplants prefer low light and may actually suffer in direct sunlight, so there’s no need to place them in your brightest windows. They do like a little bit of light, and will do best by a window that receives some early morning or late afternoon light.",        
        "planting_Space": "A cactus should have a minimum of 1/4 inch of space between its main body and the pot's rim.",
        "soil_requirements": "Sand, loam, and clay. Apply a balanced (20-20-20) liquid fertilizer monthly. Another option is to reduce to quarter strength and apply weekly when lightly watering.",        
        "water_requirements": "Parlor Palm prefers areas with high humidity. The soil around a Parlor Palm should be evenly moist. Water freely during the growing season but reduce the frequency of watering during the winter. Make sure that the soil remains moist but well drained.",
        "common_issues": "Plants may experience difficulty with scale insects, mealybugs, and spider mites. Typical pathogen (fungal and bacterial) that may infect Parlor Palm houseplants are fungal leaf spots, root rot, and stem cankers. Fungal leaf spots and root rot are usually indicative of excessive watering and other moisture problems.",        
        "harvesting": "Not Available",
        "storage_wrap": "Not Available",
        "others": "Parlor palm seed germination may require several months. Transplant the seedling to a larger pot after one or two leaves appear. Be careful not to plant too deeply."        
    },
    {
        "id": "P13",
        "name": "Money Plant",
        "type": "Climbing Plant",
        "category": "Biennial",
        "image": "money-plant.jpg",
        "description": "The plant is called a money plant because its leaves (round, flat, heart-shaped, dark green, and plump) resemble coins. It may be grown as either a trailer or a climber. Young plants bear three to four-inch-long heart-shaped leaves. This plant is grown mainly indoors.",        
        "light_requirements": "Direct and indirect sun light. However, too much direct sun light can turn the leaves yellow and even burn them.",        
        "planting_Space": "A cactus should have a minimum of 1/4 inch of space between its main body and the pot's rim.",
        "soil_requirements": "They are very easy to grow, both in soil and water filled bottles, jars and any container. Normally, no fertilizer is necessary for moneyplant. However, you can give a liquid nitrate based feed occasionally.You can make a homemade fertilizer for money plant by adding used tea leaves, coffee grounds and powdered egg shells in soil. Money plant care is quite easy and needs no expertise.",        
        "water_requirements": "In soil over-watering will cause roots to rot. Leaves turning yellow and curling up is the sign of excessive watering.",
        "common_issues": "Overwatering and too much sunlight are the most common causes of problems with money plants, though they can also suffer from scale insects, mealybugs, and aphids. Bugs can be treated with a systemic insect control, or horticultural oil spray.",        
        "harvesting": "Not Available",
        "storage_wrap": "Not Available",
        "others": "Money plant (Scientific or Botanical name: Epipremnum aureum) is a popular houseplant that is grown indoors mostly in water. It is believed that having a money plant at home brings benefits such as good luck, happiness, wealth and prosperity."        
    },
    {
        "id": "P14",
        "name": "Jade Plant",
        "type": "Succulent",
        "category": "Perennial",
        "image": "jade.jpg",
        "description": "With their thick, woody stems and oval-shaped leaves, jade plants have a miniature, tree-like appearance that makes them very appealing for use as a decorative houseplant. They live for a very long time, often being passed down from generation to generation and reaching heights of three feet or more when grown indoors.",        
        "light_requirements": "Jade plants need at least 4 hours of direct sunlight each day. They can handle direct sunlight, so kitchens and offices with a south-facing window are typically great spots with just enough light. Western windows are also a great location to keep jades.",        
        "planting_Space": "Select a container that has at least 1 drainage hole and is no more than 2 inches wider than the root ball of your jade plant. (Jade plants actually don’t mind being a little crowded.)",
        "soil_requirements": "It’s important to keep the soil moist—not wet—during the growing season (spring, summer) and drier during the dormant season (fall, winter).",        
        "water_requirements": "After planting a jade plant, don’t water it right away. Waiting anywhere from several days to a week before watering lets the roots settle and recover from any damage.",
        "common_issues": "Mealybugs or scale may hide under stems and leaves. Root rot is caused by excessive moisture in the soil. Let the soil dry out between waterings.",        
        "harvesting": "New jade plants can easily be started from the leaves of mature plants.",
        "storage_wrap": "Not Available",
        "others": "Jade are not frost tolerant, so if you keep yours outdoors during the summer, be sure to bring it inside once temperatures fall to around 50°F (10°​​​​​​​C) in autumn."          
    },    
    {
        "id": "P15",
        "name": "Assorted Succulent Collection",
        "type": "Succulent",
        "category": "Perennial",
        "image": "succulent1.jpg",
        "description": "Can't decide what type of succulents to buy? Then this collection is perfect for you! A grower's choice assortment of tender succulents.",        
        "light_requirements": "They like good, bright light up to full sunlight.",        
        "planting_Space": "Select a container that has at least 1 drainage hole and is no more than 2 inches wider than the root ball of your jade plant. (Jade plants actually don’t mind being a little crowded.)",
        "soil_requirements": "Keep soil relatively moist, letting them dry out somewhat between waterings. Diluted fertilizer can be used every second or third watering during their prime growing time.",        
        "water_requirements": "Not much",
        "common_issues": "Mealybugs or scale may hide under stems and leaves. Root rot is caused by excessive moisture in the soil. Let the soil dry out between waterings.",        
        "harvesting": "Not Available",
        "storage_wrap": "Not Available",
        "others": "This collection contains 10 assorted plugs."        
    },
    {
        "id": "P16",
        "name": "Haworthia Zebra",
        "type": "Succulent",
        "category": "Perennial",
        "image": "zebra.jpg",
        "description": "Haworthia is delightful little succulents that are very attractive small houseplants. These small, low growing plants form rosettes of fleshy green leaves that are generously covered with white, pearly warts or bands, giving them a distinctive appearance.",        
        "light_requirements": "Haworthia species like bright light, but not direct sunlight. They do best in a room with a window facing east or west to provide bright light for a few hours a day.",        
        "planting_Space": "Haworthia are small (usually remaining between 3 inches and 5 inches in height) and relatively slow-growing. They are often grown in small clusters in wide, shallow dishes. Over time, clusters will naturally enlarge as the mother plant sends off small plantlets.",
        "soil_requirements": "Sandy, Soil pH: 6.6 to 7.5",        
        "water_requirements": "Water evenly and generously in the summer, letting the soil media dry out between waterings. In the winter, reduce watering to every other month. Never allow water to collect in the rosette.",
        "common_issues": "Plant collapse, this has likely been caused by a toxic combination of overwatering and exposure to cold temperatures.",        
        "harvesting": "Not Available",
        "storage_wrap": "Not Available",
        "others": "plant will spread and grow into a clump, so one solo plant at the start will quickly become many which in turn will eventually fill a pot to add some impressive visual appeal. You can let the clump continue to grow and spread within the existing container, or separate them for even more plants."        
    },
    {
        "id": "P17",
        "name": "Lady Fern",
        "type": "Fern",
        "category": "Perennial",
        "image": "lady_fern.jpg",
        "description": "Lady fern plants are reliable, native plants and easy to grow in a moist, partially shaded location.",
        "light_requirements": "Full to partial shade.",        
        "planting_Space": "12 to 15 inches for smaller varieties, 15 to 18 inches or more for larger plants.",
        "soil_requirements": "Sandy, Soil pH: 6.6 to 7.5",        
        "water_requirements": "Water regularly when planting lady ferns in a new spot. Once established, however, the plants are somewhat drought resistant.",        
        "common_issues": "Pests",        
        "harvesting": "Not Available",
        "storage_wrap": "Not Available",
        "others": "The Lady Fern is an ornamental foliage plant that adapts readily to cultivation."        
    },
    {
        "id": "P18",
        "name": "Roses",
        "type": "Flower",
        "category": "Perennial",
        "image": "rose.jpg",
        "description": "Roses, with their beauty and fragrance are one of the the most popular choices of flowers for your garden and for gift giving. You can have the perfect rose garden by following the simple gardening tips below on how to plant roses. If you thought roses were hard to grow, take another look! They make a great addition to any outdoor living space.",
        "light_requirements": "Generally roses do best in full sun but if you're unable to provide them with that type of sunlight, a minimum on 4 to 6 hours of sun will suffice.",        
        "planting_Space": "Depending on the species of rose you're planting the range could vary from 24 inches to 5 or 6 feet.",
        "soil_requirements": "Roses like clay soil, still they may be grown in various type of soil, as long as a good amount of organic matter is worked in. Very heavy soils are best improved by replacing at least half of the soil with sharp-sand or perlite.",        
        "water_requirements": "Even though roses are fans of good drainage, they do need a lot of water during the growing season. During prolonged dry spells they should be thoroughly soaked once or twice a week depending on the moisture holding capacity of the soil.",        
        "common_issues": "Black spot is one of the most common diseases to afflict roses. As a waterborne disease, it will appear during humid weather and spread through irrigation.",        
        "harvesting": "The petals from roses can be harvested and then used in foods like jams, salads, and syrups.",
        "storage_wrap": "Refrigerate the flowers to keep them fresh.",
        "others": "Roses are loved and valued for their timeless beauty, colour and fragrance of their blooms. As a cut flower, no other plant compares."        
    },
    {
        "id": "P19",
        "name": "Cherry Blossom",
        "type": "Tree",
        "category": "Perennial",
        "image": "cherry_blossom.jpg",
        "description": "Cherry blossom trees are beautiful and vibrant, but they’re also finicky and hard to grow.",
        "light_requirements": "cherry trees prefer full sun",        
        "planting_Space": "Planted in an open spot that gets lots of air (but not strong winds); this helps ensure the tree dries quickly following rain, so that it is less likely to be exposed to pests or diseases.",
        "soil_requirements": "Soil should be nutrious, deep, fertile and moist, but well drained.",        
        "water_requirements": "Water in well, apply a granular general feed over the soil around the tree and add a 5-7.5cm (2-3in) deep mulch of well-rotted garden compost or bark chippings around the root area. They may need watering during prolonged dry periods in summer.",        
        "common_issues": "Cherry blossom trees are delicate and will not tolerate over-exposure to heat or cold.",        
        "harvesting": "Not Available",
        "storage_wrap": "Not Available",
        "others": "Cherry Blossoms are some of the most beautiful flowers, coming in bright colors. The Cherry Blossom tree in full bloom, during the arrival of spring, is one of the most beautiful sights to behold."        
    },
    {
        "id": "P20",
        "name": "Peonies",
        "type": "Flower",
        "category": "Perennial",
        "image": "peonies.jpg",
        "description": "Peonies are one of the best-known and most dearly loved perennials. This is hardly surprising considering their sumptuous beauty and fragrance, trouble-free nature and longevity. Peonies also thrive almost anywhere in the country.",
        "light_requirements": "Full Sun, Part Sun",        
        "planting_Space": "Space peonies 3 to 4 feet apart for good air circulation.",
        "soil_requirements": "Loamy, with PH level neutral. Spare the fertilizer. Work the soil well before you plant, mixing in compost and a little fertilizer, and that should be enough.",        
        "water_requirements": "Water in well, apply a granular general feed over the soil around the tree and add a 5-7.5cm (2-3in) deep mulch of well-rotted garden compost or bark chippings around the root area. They may need watering during prolonged dry periods in summer.",        
        "common_issues": "Peonies are generally very hardy. However, they are susceptible to: Ringspot virus, Stem rot, Japanese beetles.",        
        "harvesting": "Peonies make wonderful cut flowers, lasting more than a week in a vase. For best results, cut long stems in the morning when the buds are still fairly tight.",
        "storage_wrap": "You can wrap freshly cut peony stems in damp paper towel and put them in a plastic bag in the refrigerator until you’re ready to use them. When removing the peonies from the refrigerator give the stems a fresh cut and place them in lukewarm water to wake them up.",
        "others": "Peonies are said to symbolize a happy life and a happy marriage. Like children, young peonies take time to develop. They usually need a few years to establish themselves, bloom, and grow."        
    },
    {
        "id": "P21",
        "name": "Callisia Plants",
        "type": "Basket Plant",
        "category": "Perennial",
        "image": "callisia.jpg",
        "description": "As with many houseplants, basket plant purifies indoor air pollutants. In addition, all parts of the plant are edible and used in herbal remedies. This Callisia plant is native to Mexico and South America. In cooler climates, Callisia basket plant is more commonly grown as a houseplant in hanging baskets.",         
        "light_requirements": "Low to medium light.",        
        "planting_Space": "Provide ample room for this big, spreading plant.",
        "soil_requirements": "It grows well in fertile soils. During spring, summer and fall, fertilize basket plants with a regular 10-10-10 fertilizer monthly. In the winter, stop fertilizing.",                
        "water_requirements": "Water every 2-3 days. During winter water less frequently.",        
        "common_issues": "Callisia Fragrans is much appreciated because it does not require special care, so much chin pruning. The only precaution to be taken is that concerning the dry leaves, which must be promptly eliminated so that the environment suitable for the proliferation of pests is not created. In such cases it is possible to use a simple pesticide to solve the problem.",        
        "harvesting": "The Callisia should never be over-harvested, this weakens the plant.",
        "storage_wrap": "Not Available.",
        "others": "Callisia comes from the Latin words for beautiful lily. Though Callisia looks like a lily or a bromeliad and grows like a spider plants, it is actually in the wandering jew family and is just as easy to grow and care for these plants."        
    }
]

